# <font color=#023F7C> **Data cleaning and exploration** </font>

<font color=#023F7C>**Hi! PARIS DataBootcamp 2024 üöÄ**</font> <br>


<img src = https://www.hi-paris.fr/wp-content/uploads/2020/09/logo-hi-paris-retina.png width = "300" height = "200" >

**<font size='4'><u>Goal of this practical session</u>**</font> <br>

You've been provided a `athlete_events.csv` dataset containing **historical data on the modern Olympic Games**, including all the Games from Athens 1896 to Rio 2016. The dataset contains 15 column and each row corresponds to an individual athlete competing in an individual Olympic event.

The goal of this practical session is to get to know this large dataset and clean it from missing values and inconsistencies. <br>
Don't forget to **save the cleaned dataset** at the end of the session, since it will be used for the Data Visualization practical session.

**<font size='4'><u>What is Data cleaning ?</u>**</font> <br>

Data cleaning is a crucial step in the data analysis and machine learning process, as the quality of the insights and models generated heavily relies on the accuracy and reliability of the underlying data. Raw data often contains **errors**, **inconsistencies**, **missing values**, and **outliers** that can distort results or lead to faulty conclusions. Data cleaning involves identifying and rectifying these issues, ensuring the dataset is trustworthy and suitable for analysis.

**<font size='4'><u>Before you start to working on this notebook ‚ö†Ô∏è</u>**</font> <br>

Please download/copy this notebook from `hfactory_magic_folders\course` and drop it into your own directory `my_work` on HFactory. <br>
If you don't, you won't be able to save the modifications you've made on this notebook.

**<font size='4'><u>Need help ?</u>**</font> <br>

If you struggling with this notebook, you can go to the **Beginner and Intermediate python notebooks** for guidance. <br>
Don't hesitate to also ask help from the bootcamp's team/speakers.

## **1. Import libraries and dataset**
First, let's import Python libraries.

In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib as plt

pd.set_option("display.max_columns", None)  # Show all columns

Then, let's import the dataset using the pandas `pd.read_csv()` function. <br>

In [2]:
# Path to the dataset in HFactory
path = r"~/hfactory_magic_folders/course/data/athlete_events.csv"
path = "./data/athlete_events.csv"
# Import the csv file
df_dataset = pd.read_csv(path, encoding="latin-1")

## **2. Data discovery**

**Question 1**: <br>
**Display the dataset's head and tail.**

In [4]:
df_dataset.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

In [5]:
df_dataset.tail()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
271111,135569,Andrzej ya,M,29.0,179.0,89.0,Poland-1,POL,1976 Winter,1976,Winter,Innsbruck,Luge,Luge Mixed (Men)'s Doubles,NaN
271112,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Individual",NaN
271113,135570,Piotr ya,M,27.0,176.0,59.0,Poland,POL,2014 Winter,2014,Winter,Sochi,Ski Jumping,"Ski Jumping Men's Large Hill, Team",NaN
271114,135571,Tomasz Ireneusz ya,M,30.0,185.0,96.0,Poland,POL,1998 Winter,1998,Winter,Nagano,Bobsleigh,Bobsleigh Men's Four,NaN
271115,135571,Tomasz Ireneusz ya,M,34.0,185.0,96.0,Poland,POL,2002 Winter,2002,Winter,Salt Lake City,Bobsleigh,Bobsleigh Men's Four,NaN

**Question 2**: <br> **Use the pandas function `.info()` to get general information on the dataset.**<br>

In [7]:
df_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     261642 non-null  float64
 4   Height  210945 non-null  float64
 5   Weight  208241 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   39783 non-null   object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [8]:
df_dataset["Age"].info()

<class 'pandas.core.series.Series'>
RangeIndex: 271116 entries, 0 to 271115
Series name: Age
Non-Null Count   Dtype
--------------   -----
261642 non-null  float64
dtypes: float64(1)
memory usage: 2.1 MB

**What can you say about the loaded dataset ?**

There is a lot of missing values in body type and medals. The games are categorical also.

**Question 3**:  <br> **Print all the columns/variables of the dataset.**

In [9]:
df_dataset.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

## **3. Analyze the dataframe's dtypes**
**Question 4**: <br>
**Create 3 lists, each containing columns names with an int, float and object type.**
- List 1: Columns with an `int64` type
- List 2: Columns with a `float64` type
- List 3: Columns with an `object` type.

*Note: You can use pandas' `.select_dtypes()` function to get columns with a specific dtype.* <br>
*Create a list from a Pandas Dataframe/series with `.to_list()`*

In [16]:
col_int = df_dataset.select_dtypes(int).columns.to_list()
print("int", col_int)
col_float = df_dataset.select_dtypes(float).columns.to_list()
print("float", col_float)
col_obj = df_dataset.select_dtypes(exclude=[int, float]).columns.to_list()
print("obj", col_obj)

int ['ID', 'Year']
float ['Age', 'Height', 'Weight']
obj ['Name', 'Sex', 'Team', 'NOC', 'Games', 'Season', 'City', 'Sport', 'Event', 'Medal']

**Question 5**: <br>
**Compute the number of unique values for the columns with an object and int type.** <br>

*Note: Combine the list with int columns and object columns using the `+` operator*. <br>
*Create a dataframe with the number of unique values and the corresponding variable.*

In [23]:
df_nbunique = df_dataset[col_int + col_obj].nunique().to_frame()
df_nbunique.columns = ["nb_unique_values"]
df_nbunique

        nb_unique_values
ID                135571
Year                  35
Name              134732
Sex                    2
Team                1184
NOC                  230
Games                 51
Season                 2
City                  42
Sport                 66
Event                765
Medal                  3

**Which column/variable has over 15 unique values ?**

In [24]:
df_nbunique[df_nbunique["nb_unique_values"] > 15]

       nb_unique_values
ID               135571
Year                 35
Name             134732
Team               1184
NOC                 230
Games                51
City                 42
Sport                66
Event               765

**Question 6**: <br>
**Compute the summary statistics of columns with a float type, with pandas' `.describe()` function.** <br>

In [26]:
df_dataset[col_float].describe()

                 Age         Height         Weight
count  261642.000000  210945.000000  208241.000000
mean       25.556898     175.338970      70.702393
std         6.393561      10.518462      14.348020
min        10.000000     127.000000      25.000000
25%        21.000000     168.000000      60.000000
50%        24.000000     175.000000      70.000000
75%        28.000000     183.000000      79.000000
max        97.000000     226.000000     214.000000

**Do you detect outliers (weird/abnormal values) in the data ?**

The minimum values of age and weight seems too low. The max age for an athlete is also too high.

## **4. Analyze missing values**

**Question 7**: <br> **Compute the number of NaN value for every variable/column** <br>

*Note: A NaN value represents a missing value in a cell of the dataframe* <br>
*You can use the `.isna()` function.*

**Which variables of the dataset has missing values ?**

In [30]:
df_dataset.isna().sum().to_frame()

             0
ID           0
Name         0
Sex          0
Age       9474
Height   60171
Weight   62875
Team         0
NOC          0
Games        0
Year         0
Season       0
City         0
Sport        0
Event        0
Medal   231333

**Question 8 :  <br>
What can you say about None Value? Do they all mean the same thing? Should we delete all the missing Values? <br>**

- In Age, Height and Weight, None means unknown.
- But for Medal, None is no "medal"/

**Question 9: <br>
Fill the NaN line of the column `Medal` with the string `None`.**

In [34]:
df_dataset["Medal"] = df_dataset["Medal"].fillna("None")
df_dataset["Medal"].value_counts()

Medal
None      231333
Gold       13372
Bronze     13295
Silver     13116
Name: count, dtype: int64

**Question 10:** <br>
**Drop the rows of the dataset that have missing values with `.dropna(axis=0)`. <br>**
Don't forget to add `.reset_index(drop=True)` after dropping the NaN values in the dataframe !

In [45]:
df_dataset_clean = df_dataset.dropna(axis=0).reset_index(drop=True)
df_dataset_clean.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206165 entries, 0 to 206164
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      206165 non-null  int64
 1   Name    206165 non-null  object
 2   Sex     206165 non-null  object
 3   Age     206165 non-null  float64
 4   Height  206165 non-null  float64
 5   Weight  206165 non-null  float64
 6   Team    206165 non-null  object
 7   NOC     206165 non-null  object
 8   Games   206165 non-null  object
 9   Year    206165 non-null  int64
 10  Season  206165 non-null  object
 11  City    206165 non-null  object
 12  Sport   206165 non-null  object
 13  Event   206165 non-null  object
 14  Medal   206165 non-null  object
dtypes: float64(3), int64(2), object(10)
memory usage: 23.6+ MB

**If you don't want to drop rows, you can replace the missing values in each variable** <br>
Try the following methods only if the variable has a small number of NaN values (less than 10%).
- Replace with the mean or median value for continuous variables (mostly columns with a float dtype)
- Replace with the variable's most frequent value (`.mode()`) or by creating a new category for categorical variables (mostly columns with an int/object dtype)

You can drop the variables with a high number of missing values.

At this step, the dataset shouldn't have any missing values (you can check with `.isna().sum().sum()`)

In [40]:
df_dataset_replaced = df_dataset.copy()
df_dataset_replaced["Height"] = df_dataset_replaced["Height"].fillna(
    df_dataset_replaced["Height"].mean()
)
df_dataset_replaced["Weight"] = df_dataset_replaced["Weight"].fillna(
    df_dataset_replaced["Weight"].mean()
)
df_dataset_replaced["Age"] = df_dataset_replaced["Age"].fillna(
    df_dataset_replaced["Age"].mean()
)
df_dataset_replaced.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 271116 entries, 0 to 271115
Data columns (total 15 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   ID      271116 non-null  int64
 1   Name    271116 non-null  object
 2   Sex     271116 non-null  object
 3   Age     271116 non-null  float64
 4   Height  271116 non-null  float64
 5   Weight  271116 non-null  float64
 6   Team    271116 non-null  object
 7   NOC     271116 non-null  object
 8   Games   271116 non-null  object
 9   Year    271116 non-null  int64
 10  Season  271116 non-null  object
 11  City    271116 non-null  object
 12  Sport   271116 non-null  object
 13  Event   271116 non-null  object
 14  Medal   271116 non-null  object
dtypes: float64(3), int64(2), object(10)
memory usage: 31.0+ MB

In [42]:
print("There is", int(df_dataset_replaced.isna().sum().sum()), "null values.")

There is 0 null values.

**Question 11**: <br>
**Save the cleaned dataframe as a csv file called `dataset_train_clean.csv` using pandas' `.to_csv()` function.** <br>
*Note: Make sure to add `index=False` to the `.to_csv()` function or else the index of the dataframe will be saved too.*

In [46]:
df_dataset_clean.to_csv("dataset_train_clean.csv", index=False)